In [1]:
import pandas as pd 
import numpy as np
pd.__version__ # know the pandas version

'2.0.3'

In [2]:
df=pd.DataFrame({
    "name": ["yammu","sai"],
    "age":[12,34]})
df

    name  age
0  yammu   12
1    sai   34

In [3]:
df=pd.read_csv(r"C:\Users\YAMUNA\OneDrive\Documents\study_marks.csv")
df

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

# writing tha data

In [4]:
df.to_csv('data.csv',index=False)

# Exploring the data

In [5]:
df.head()

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0

In [6]:
df.tail()

   Study_Hours  Marks
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Study_Hours  10 non-null     float64
 1   Marks        10 non-null     float64
dtypes: float64(2)
memory usage: 292.0 bytes

In [9]:
df.shape

(10, 2)

In [10]:
df[2:5]

   Study_Hours  Marks
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0

In [11]:
df.columns

Index(['Study_Hours', 'Marks'], dtype='object')

In [12]:
df.Marks

0    27.0
1    61.0
2    45.0
3    38.0
4    19.0
5     8.0
6     4.0
7    50.0
8    35.0
9    47.0
Name: Marks, dtype: float64

In [13]:
df.Study_Hours

0    2.9
1    5.8
2    4.7
3    4.0
4    1.8
5    1.8
6    1.3
7    5.3
8    4.0
9    4.5
Name: Study_Hours, dtype: float64

In [14]:
df[["Study_Hours","Marks"]]

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

In [15]:
df['Study_Hours'].max()

5.8

In [16]:
df['Study_Hours'].min()

1.3

In [17]:
df['Marks'].mean()

33.4

In [18]:
df['Marks'].mode()

0     4.0
1     8.0
2    19.0
3    27.0
4    35.0
5    38.0
6    45.0
7    47.0
8    50.0
9    61.0
Name: Marks, dtype: float64

In [19]:
df['Study_Hours'].describe()

count    10.000000
mean      3.610000
std       1.575119
min       1.300000
25%       2.075000
50%       4.000000
75%       4.650000
max       5.800000
Name: Study_Hours, dtype: float64

In [20]:
df[df.Study_Hours==df.Study_Hours.max()]

   Study_Hours  Marks
1          5.8   61.0

In [22]:
df.Marks[df.Study_Hours==df.Study_Hours.max()]

1    61.0
Name: Marks, dtype: float64